#+TITLE: January 18, 2018 - January 30, 2018
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                         | CANCELED |
|------+------+-------------+---------+--------------------------------------------------------------+----------|
|      |      |             |         | READ.1516343810. Docker Course DO180 (2018-01-30)            |          |
|      |      |             |         | READ.1516344152. You Don't Know JavaScript - Sc (2018-01-30) |          |
|      |      |             |         | READ.1516344108. You Don't Know JavaScript - Up (2018-01-24) |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME      | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|-----------+-----------+--------+------+-----------+--------------+------------|
| Sandeepk  |      16.0 |  10.33 | 16.0 |         0 |   2018-01-31 | ########## |
| Bhavin192 |       8.0 |   9.48 |  8.0 |         0 |   2018-01-31 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph

#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:13]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                 |
|-----+------------+--------+-------+---------------------------------|
|   1 | 2018-01-18 |   24.0 |    22 |                                 |
|   2 | 2018-01-19 |   24.0 |    20 |                                 |
|   3 | 2018-01-20 |   24.0 |    18 |                                 |
|   4 | 2018-01-21 |   24.0 |    17 |                                 |
|   5 | 2018-01-22 |   24.0 |    15 |                                 |
|   6 | 2018-01-23 |   24.0 |    13 |                                 |
|   7 | 2018-01-24 |   19.0 |    11 | READ.1516344108                 |
|   8 | 2018-01-25 |   19.0 |     9 |                                 |
|   9 | 2018-01-26 |   19.0 |     7 |                                 |
|  10 | 2018-01-27 |   19.0 |     6 |                                 |
|  11 | 2018-01-28 |   19.0 |     4 |                                 |
|  12 | 2018-01-29 |   19.0 |     2 |                                 |
|  13 | 2018-01-30 |    0.0 |     0 | READ.1516344152 READ.1516343810 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                | TASKID          | OWNER     | PRIORITY | TODO | ESTIMATED |             ACTUAL |
|-----------------------------------------------------+-----------------+-----------+----------+------+-----------+--------------------|
| TASKS                                               |                 |           | B        |      |      24.0 | 19.810000000000002 |
|-----------------------------------------------------+-----------------+-----------+----------+------+-----------+--------------------|
| Docker Course DO180                                 | READ.1516343810 | bhavin192 | B        | DONE |       8.0 |               9.48 |
|-----------------------------------------------------+-----------------+-----------+----------+------+-----------+--------------------|
| You Don't Know JavaScript - Up & Going              | READ.1516344108 | sandeepk  | B        | DONE |       5.0 |               6.50 |
|-----------------------------------------------------+-----------------+-----------+----------+------+-----------+--------------------|
| You Don't Know JavaScript - Scope & Closures Part I | READ.1516344152 | sandeepk  | B        | DONE |      11.0 |               3.83 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2018-01-18 Thu>
  :wpd-bhavin192: 1
  :wpd-sandeepK: 1
  :END:
** DONE Docker Course DO180 [8/8]
   CLOSED: [2018-01-30 Tue 22:00]
   :PROPERTIES:
   :ESTIMATED: 8.0
   :ACTUAL:   9.48
   :OWNER: bhavin192
   :ID: READ.1516343810
   :TASKID: READ.1516343810
   :END:
   :LOGBOOK:
   CLOCK: [2018-01-30 Tue 19:05]--[2018-01-30 Tue 19:45] =>  0:40
   CLOCK: [2018-01-30 Tue 18:10]--[2018-01-30 Tue 18:42] =>  0:32
   CLOCK: [2018-01-29 Mon 19:28]--[2018-01-29 Mon 20:10] =>  0:42
   CLOCK: [2018-01-29 Mon 18:49]--[2018-01-29 Mon 19:20] =>  0:31
   CLOCK: [2018-01-27 Sat 17:15]--[2018-01-27 Sat 18:04] =>  0:49
   CLOCK: [2018-01-26 Fri 20:25]--[2018-01-26 Fri 21:31] =>  0:66
   CLOCK: [2018-01-26 Fri 20:00]--[2018-01-26 Fri 20:15] =>  0:15
   CLOCK: [2018-01-24 Wed 22:18]--[2018-01-24 Wed 23:08] =>  0:50
   CLOCK: [2018-01-23 Tue 21:45]--[2018-01-23 Tue 22:41] =>  0:56
   CLOCK: [2018-01-22 Mon 21:25]--[2018-01-22 Mon 21:49] =>  0:24
   CLOCK: [2018-01-22 Mon 19:35]--[2018-01-22 Mon 20:35] =>  1:00
   CLOCK: [2018-01-19 Fri 20:52]--[2018-01-19 Fri 21:25] =>  0:33
   CLOCK: [2018-01-18 Thu 19:15]--[2018-01-18 Thu 19:51] =>  0:36
   CLOCK: [2018-01-18 Thu 18:38]--[2018-01-18 Thu 19:13] =>  0:35
   :END:
   - [X] 1. Get started with container technology (45 minutes)
   - [X] 2. Create containerized services (45 minutes)
   - [X] 3. Manage containers (90 minutes)
   - [X] 4. Manage container images (50 minutes)
   - [X] 5. Create custom container images (60 minutes)
   - [X] 6. Deploy containerized applications on OpenShift (50 minutes)
   - [X] 7. Deploy multi-container applications (90 minutes)
   - [X] 8. Troubleshoot containerized applications (45 minutes)

** DONE You Don't Know JavaScript - Up & Going [3/3]
   CLOSED: [2018-01-24 Wed 08:00]
   :PROPERTIES:
   :ESTIMATED: 5.0
   :ACTUAL:   6.50
   :OWNER: sandeepk
   :ID: READ.1516344108
   :TASKID: READ.1516344108
   :END:
   :LOGBOOK:
   CLOCK: [2018-01-23 Tue 23:20]--[2018-01-24 Wed 00:30] =>  1:10
   CLOCK: [2018-01-22 Mon 23:00]--[2018-01-23 Tue 00:00] =>  1:00
   CLOCK: [2018-01-21 Sun 04:00]--[2018-01-21 Sun 05:30] =>  1:30
   CLOCK: [2018-01-20 Sat 23:40]--[2018-01-21 Sun 00:30] =>  0:50
   CLOCK: [2018-01-19 Fri 23:31]--[2018-01-20 Sat 00:31] =>  1:00
   CLOCK: [2018-01-18 Thu 23:32]--[2018-01-19 Fri 00:32] =>  1:00
   :END:
   - [X] Chapter 1: Into Programming
   - [X] Chapter 2: Into JavaScript
   - [X] Chapter 3: Into YDKJS

** DONE You Don't Know JavaScript - Scope & Closures Part I [2/2]
   CLOSED: [2018-01-30 Wed 12:00]
   :PROPERTIES:
   :ESTIMATED: 11.0
   :ACTUAL:   3.83
   :OWNER: sandeepk
   :ID: READ.1516344152
   :TASKID: READ.1516344152
   :END:
   :LOGBOOK:
   CLOCK: [2018-01-29 Mon 23:00]--[2018-01-30 Tue 00:00] =>  1:00
   CLOCK: [2018-01-26 Fri 23:50]--[2018-01-27 Sat 00:40] =>  0:50
   CLOCK: [2018-01-25 Thu 23:00]--[2018-01-26 Wed 00:00] =>  1:00
   CLOCK: [2018-01-24 Wed 23:00]--[2018-01-25 Thu 00:00] =>  1:00

   :END:
   - [X] Chapter 1: What is Scope?
   - [X] Chapter 2: Lexical Scope
